const field = [
    {
        name: "草原",
        elv: 1,
        plv: 1,
        require: ["洞窟", "氷原", "峡谷", "火山", "沼", "毒沼", "冥界", "秘境", "氷山", "遺跡"],
    },
    {
        name: "洞窟",
        elv: 100,
        plv: 100,
        require: ["草原", "氷原", "峡谷", "火山", "沼", "毒沼", "冥界", "秘境", "氷山", "地獄", "遺跡"],
    },
    {
        name: "氷原",
        elv: 100,
        plv: 100,
        require: ["草原", "沼", "毒沼", "冥界", "秘境", "氷山"],
    },
    {
        name: "峡谷",
        elv: 300,
        plv: 100,
        require: ["洞窟", "火山", "地獄", "遺跡"],
    },
    {
        name: "火山",
        elv: 300,
        plv: 300,
        require: ["洞窟", "峡谷", "秘境", "地獄", "遺跡"],
    },
    {
        name: "沼",
        elv: 300,
        plv: 100,
        require: ["草原", "洞窟", "火山", "毒沼", "湖", "冥界", "秘境", "氷山", "地獄"],
    },
    {
        name: "毒沼",
        elv: 500,
        plv: 800,
        require: ["沼", "火山", "地獄", "湖"],
    },
    {
        name: "湖",
        elv: 500,
        plv: 800,
        require: ["沼", "遺跡"],
    },
    {
        name: "冥界",
        elv: 800,
        plv: 1000,
        require: ["毒沼", "湖", "地獄"],
    },
    {
        name: "秘境",
        elv: 500,
        plv: 800,
        require: ["火山", "遺跡"],
    },
    {
        name: "氷山",
        elv: 800,
        plv: 1000,
        require: ["氷原", "天界"],
    },
    {
        name: "天界",
        elv: 1000,
        plv: 1200,
        require: ["氷山"],
    },
    {
        name: "遺跡",
        elv: 1000,
        plv: 1200,
        require: ["湖", "秘境"],
    },
];

module.exports = field;